In [1]:
import pandas as pd

In [4]:
df=pd.read_csv('annualreport.csv')

In [5]:
df.head()

,year,industry_code_ANZSIC,industry_name_ANZSIC,rme_size_grp,variable,value,unit
0,2011,A,"Agriculture, Forestry and Fishing",a_0,Activity unit,46134,COUNT
1,2011,A,"Agriculture, Forestry and Fishing",a_0,Rolling mean employees,0,COUNT
2,2011,A,"Agriculture, Forestry and Fishing",a_0,Salaries and wages paid,279,DOLLARS(millions)
3,2011,A,"Agriculture, Forestry and Fishing",a_0,"Sales, government funding, grants and subsidies",8187,DOLLARS(millions)
4,2011,A,"Agriculture, Forestry and Fishing",a_0,Total income,8866,DOLLARS(millions)

In [6]:
df.shape

(13932, 7)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13932 entries, 0 to 13931
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   year                  13932 non-null  int64
 1   industry_code_ANZSIC  13932 non-null  object
 2   industry_name_ANZSIC  13932 non-null  object
 3   rme_size_grp          13932 non-null  object
 4   variable              13932 non-null  object
 5   value                 13932 non-null  object
 6   unit                  13932 non-null  object
dtypes: int64(1), object(6)
memory usage: 762.0+ KB

In [10]:
person={
     "first":"Danish",
     "last":"Anwer",
    "email":"Danish@gmail.com"
}

In [11]:
people={
     "first":["Danish"],
     "last":["Anwer"],
    "email":["Danish@gmail.com"]
}

In [12]:
people={
     "first":["Danish","Sanketa","Hari"],
     "last":["Anwer","Hegde","Vishnu"],
    "email":["Danish@gmail.com","sanketa@gmail.com","vishnu@gmail.com"]
}

In [13]:
people["email"]

['Danish@gmail.com', 'sanketa@gmail.com', 'vishnu@gmail.com']

In [14]:
data=pd.DataFrame(people)

In [15]:
data.head()

     first    last              email
0   Danish   Anwer   Danish@gmail.com
1  Sanketa   Hegde  sanketa@gmail.com
2     Hari  Vishnu   vishnu@gmail.com

In [17]:
data["email"]

0     Danish@gmail.com
1    sanketa@gmail.com
2     vishnu@gmail.com
Name: email, dtype: object

In [18]:
type(data["email"])

pandas.core.series.Series

In [19]:
data.shape

(3, 3)

In [20]:
data.email

0     Danish@gmail.com
1    sanketa@gmail.com
2     vishnu@gmail.com
Name: email, dtype: object

In [23]:
data[['email','first']]

               email    first
0   Danish@gmail.com   Danish
1  sanketa@gmail.com  Sanketa
2   vishnu@gmail.com     Hari

In [24]:
data.columns

Index(['first', 'last', 'email'], dtype='object')

In [25]:
#loc and iloc

data.iloc[0]

first              Danish
last                Anwer
email    Danish@gmail.com
Name: 0, dtype: object

In [26]:
data.iloc[2]

first                Hari
last               Vishnu
email    vishnu@gmail.com
Name: 2, dtype: object

In [27]:
data.iloc[[2,0]]

    first    last             email
2    Hari  Vishnu  vishnu@gmail.com
0  Danish   Anwer  Danish@gmail.com

In [28]:
data.iloc[[2,0],[2]]

              email
2  vishnu@gmail.com
0  Danish@gmail.com

In [29]:
data.head()

     first    last              email
0   Danish   Anwer   Danish@gmail.com
1  Sanketa   Hegde  sanketa@gmail.com
2     Hari  Vishnu   vishnu@gmail.com

In [30]:
data.loc[0]

first              Danish
last                Anwer
email    Danish@gmail.com
Name: 0, dtype: object

In [31]:
data.loc[[0,2]]

    first    last             email
0  Danish   Anwer  Danish@gmail.com
2    Hari  Vishnu  vishnu@gmail.com

In [32]:
data.loc[[0,2],'email']

0    Danish@gmail.com
2    vishnu@gmail.com
Name: email, dtype: object

In [33]:
data.loc[[0,2],['email','last']]

              email    last
0  Danish@gmail.com   Anwer
2  vishnu@gmail.com  Vishnu

In [34]:
df.head()

,year,industry_code_ANZSIC,industry_name_ANZSIC,rme_size_grp,variable,value,unit
0,2011,A,"Agriculture, Forestry and Fishing",a_0,Activity unit,46134,COUNT
1,2011,A,"Agriculture, Forestry and Fishing",a_0,Rolling mean employees,0,COUNT
2,2011,A,"Agriculture, Forestry and Fishing",a_0,Salaries and wages paid,279,DOLLARS(millions)
3,2011,A,"Agriculture, Forestry and Fishing",a_0,"Sales, government funding, grants and subsidies",8187,DOLLARS(millions)
4,2011,A,"Agriculture, Forestry and Fishing",a_0,Total income,8866,DOLLARS(millions)

In [35]:
df.shape

(13932, 7)

In [39]:
df['variable']

0                                          Activity unit
1                                 Rolling mean employees
2                                Salaries and wages paid
3        Sales, government funding, grants and subsidies
4                                           Total income
                              ...
13927                                       Total income
13928                                  Total expenditure
13929                        Operating profit before tax
13930                                       Total assets
13931                              Fixed tangible assets
Name: variable, Length: 13932, dtype: object

In [40]:
df['year']

0        2011
1        2011
2        2011
3        2011
4        2011
         ...
13927    2019
13928    2019
13929    2019
13930    2019
13931    2019
Name: year, Length: 13932, dtype: int64

In [41]:
df['year'].value_counts()

2015    1548
2014    1548
2013    1548
2012    1548
2019    1548
2011    1548
2018    1548
2017    1548
2016    1548
Name: year, dtype: int64

In [42]:
df.loc[0]

year                                                 2011
industry_code_ANZSIC                                    A
industry_name_ANZSIC    Agriculture, Forestry and Fishing
rme_size_grp                                          a_0
variable                                    Activity unit
value                                               46134
unit                                                COUNT
Name: 0, dtype: object

In [45]:
df.loc[[0],'year']

0    2011
Name: year, dtype: int64

In [46]:
df.loc[[0],['year','variable']]

   year       variable
0  2011  Activity unit

In [47]:
df.loc[0:2,'year':'value']

,year,industry_code_ANZSIC,industry_name_ANZSIC,rme_size_grp,variable,value
0,2011,A,"Agriculture, Forestry and Fishing",a_0,Activity unit,46134
1,2011,A,"Agriculture, Forestry and Fishing",a_0,Rolling mean employees,0
2,2011,A,"Agriculture, Forestry and Fishing",a_0,Salaries and wages paid,279

In [48]:
data

     first    last              email
0   Danish   Anwer   Danish@gmail.com
1  Sanketa   Hegde  sanketa@gmail.com
2     Hari  Vishnu   vishnu@gmail.com

In [49]:
data['email']

0     Danish@gmail.com
1    sanketa@gmail.com
2     vishnu@gmail.com
Name: email, dtype: object

In [50]:
data.set_index('email') # not inplace

                     first    last
email
Danish@gmail.com    Danish   Anwer
sanketa@gmail.com  Sanketa   Hegde
vishnu@gmail.com      Hari  Vishnu

In [52]:
data.head()

     first    last              email
0   Danish   Anwer   Danish@gmail.com
1  Sanketa   Hegde  sanketa@gmail.com
2     Hari  Vishnu   vishnu@gmail.com

In [53]:
data.set_index('email',inplace=True)

In [54]:
data

                     first    last
email
Danish@gmail.com    Danish   Anwer
sanketa@gmail.com  Sanketa   Hegde
vishnu@gmail.com      Hari  Vishnu

In [55]:
data.index

Index(['Danish@gmail.com', 'sanketa@gmail.com', 'vishnu@gmail.com'], dtype='object', name='email')

In [57]:
data.loc[0] # error will be thrown because there is no index '0' in dataframe

TypeError: cannot do label indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [0] of <class 'int'>

In [60]:
data.loc['Danish@gmail.com']

first    Danish
last      Anwer
Name: Danish@gmail.com, dtype: object

In [61]:
data.loc['Danish@gmail.com','last']

'Anwer'

In [64]:
data.iloc[0]

first    Danish
last      Anwer
Name: Danish@gmail.com, dtype: object

In [65]:
data.reset_index(inplace=True)
data.head()

               email    first    last
0   Danish@gmail.com   Danish   Anwer
1  sanketa@gmail.com  Sanketa   Hegde
2   vishnu@gmail.com     Hari  Vishnu

In [66]:
df=pd.read_csv('annualreport.csv',index_col='year')

In [68]:
df.head()

,industry_code_ANZSIC,industry_name_ANZSIC,rme_size_grp,variable,value,unit
year,,,,,,
2011,A,"Agriculture, Forestry and Fishing",a_0,Activity unit,46134,COUNT
2011,A,"Agriculture, Forestry and Fishing",a_0,Rolling mean employees,0,COUNT
2011,A,"Agriculture, Forestry and Fishing",a_0,Salaries and wages paid,279,DOLLARS(millions)
2011,A,"Agriculture, Forestry and Fishing",a_0,"Sales, government funding, grants and subsidies",8187,DOLLARS(millions)
2011,A,"Agriculture, Forestry and Fishing",a_0,Total income,8866,DOLLARS(millions)

In [70]:
df.loc[2011]

,industry_code_ANZSIC,industry_name_ANZSIC,rme_size_grp,variable,value,unit
year,,,,,,
2011,A,"Agriculture, Forestry and Fishing",a_0,Activity unit,46134,COUNT
2011,A,"Agriculture, Forestry and Fishing",a_0,Rolling mean employees,0,COUNT
2011,A,"Agriculture, Forestry and Fishing",a_0,Salaries and wages paid,279,DOLLARS(millions)
2011,A,"Agriculture, Forestry and Fishing",a_0,"Sales, government funding, grants and subsidies",8187,DOLLARS(millions)
2011,A,"Agriculture, Forestry and Fishing",a_0,Total income,8866,DOLLARS(millions)
...,...,...,...,...,...,...
2011,all,All Industries,j_Grand_Total,Total income,510905,DOLLARS(millions)
2011,all,All Industries,j_Grand_Total,Total expenditure,468838,DOLLARS(millions)
2011,all,All Industries,j_Grand_Total,Operating profit before tax,46348,DOLLARS(millions)
2011,all,All Industries,j_Grand_Total,Total assets,1662320,DOLLARS(millions)
2011,all,All Industries,j_Grand_Total,Fixed tangible assets,366725,DOLLARS(millions)

In [73]:
people={
     "first":["Danish","Sanketa","Hari"],
     "last":["Anwer","Hegde","Hegde"],
    "email":["Danish@gmail.com","sanketa@gmail.com","vishnu@gmail.com"]
}

In [74]:
data=pd.DataFrame(people)
data.head()

     first   last              email
0   Danish  Anwer   Danish@gmail.com
1  Sanketa  Hegde  sanketa@gmail.com
2     Hari  Hegde   vishnu@gmail.com

In [75]:
data['last']=='Hegde'

0    False
1     True
2     True
Name: last, dtype: bool

In [76]:
filt=data['last']=='Hegde'

In [77]:
data[filt]

     first   last              email
1  Sanketa  Hegde  sanketa@gmail.com
2     Hari  Hegde   vishnu@gmail.com

In [78]:
data[data['last']=='Hegde']

     first   last              email
1  Sanketa  Hegde  sanketa@gmail.com
2     Hari  Hegde   vishnu@gmail.com

In [79]:
data.loc[filt]

     first   last              email
1  Sanketa  Hegde  sanketa@gmail.com
2     Hari  Hegde   vishnu@gmail.com

In [80]:
data.loc[filt,'email']

1    sanketa@gmail.com
2     vishnu@gmail.com
Name: email, dtype: object

In [88]:
filt=(data['last']=='Hegde') & (data['first']=='Sanketa')
filt

0    False
1     True
2    False
dtype: bool

In [89]:
data.loc[filt]

     first   last              email
1  Sanketa  Hegde  sanketa@gmail.com

In [91]:
df.head()

,industry_code_ANZSIC,industry_name_ANZSIC,rme_size_grp,variable,value,unit
year,,,,,,
2011,A,"Agriculture, Forestry and Fishing",a_0,Activity unit,46134,COUNT
2011,A,"Agriculture, Forestry and Fishing",a_0,Rolling mean employees,0,COUNT
2011,A,"Agriculture, Forestry and Fishing",a_0,Salaries and wages paid,279,DOLLARS(millions)
2011,A,"Agriculture, Forestry and Fishing",a_0,"Sales, government funding, grants and subsidies",8187,DOLLARS(millions)
2011,A,"Agriculture, Forestry and Fishing",a_0,Total income,8866,DOLLARS(millions)

In [101]:
filt=(df['value']>='4000')

In [102]:
df.loc[filt]

,industry_code_ANZSIC,industry_name_ANZSIC,rme_size_grp,variable,value,unit
year,,,,,,
2011,A,"Agriculture, Forestry and Fishing",a_0,Activity unit,46134,COUNT
2011,A,"Agriculture, Forestry and Fishing",a_0,"Sales, government funding, grants and subsidies",8187,DOLLARS(millions)
2011,A,"Agriculture, Forestry and Fishing",a_0,Total income,8866,DOLLARS(millions)
2011,A,"Agriculture, Forestry and Fishing",a_0,Total expenditure,7618,DOLLARS(millions)
2011,A,"Agriculture, Forestry and Fishing",a_0,Operating profit before tax,770,DOLLARS(millions)
...,...,...,...,...,...,...
2019,all,All Industries,j_Grand_Total,"Sales, government funding, grants and subsidies",643809,DOLLARS(millions)
2019,all,All Industries,j_Grand_Total,Total income,728239,DOLLARS(millions)
2019,all,All Industries,j_Grand_Total,Total expenditure,634710,DOLLARS(millions)
2019,all,All Industries,j_Grand_Total,Operating profit before tax,86426,DOLLARS(millions)
2019,all,All Industries,j_Grand_Total,Fixed tangible assets,535710,DOLLARS(millions)

In [104]:
df.loc[filt,['variable','value']].reset_index()

      year                                         variable   value
0     2011                                    Activity unit   46134
1     2011  Sales, government funding, grants and subsidies    8187
2     2011                                     Total income    8866
3     2011                                Total expenditure    7618
4     2011                      Operating profit before tax     770
...    ...                                              ...     ...
5861  2019  Sales, government funding, grants and subsidies  643809
5862  2019                                     Total income  728239
5863  2019                                Total expenditure  634710
5864  2019                      Operating profit before tax   86426
5865  2019                            Fixed tangible assets  535710

[5866 rows x 3 columns]

In [105]:
data

     first   last              email
0   Danish  Anwer   Danish@gmail.com
1  Sanketa  Hegde  sanketa@gmail.com
2     Hari  Hegde   vishnu@gmail.com

In [106]:
data.columns

Index(['first', 'last', 'email'], dtype='object')

In [109]:
data.columns=["first name","last name"," Email Address"]

In [110]:
data

  first name last name      Email Address
0     Danish     Anwer   Danish@gmail.com
1    Sanketa     Hegde  sanketa@gmail.com
2       Hari     Hegde   vishnu@gmail.com

In [113]:
data.columns=data.columns.str.replace(' ','_')
data

  first_name last_name     _Email_Address
0     Danish     Anwer   Danish@gmail.com
1    Sanketa     Hegde  sanketa@gmail.com
2       Hari     Hegde   vishnu@gmail.com